# Taps
tap 'homebrew/cask-versions'

# Binaries
brew 'bash'
brew 'bat'
brew 'coreutils'
brew 'ffmpeg'
brew 'fzf'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'jq'
brew 'mas'
brew 'mysql'
brew 'nvm'
brew 'pkg-config'
brew 'ripgrep'

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'imagemagick'

# Apps
cask '1password'
brew '1password-cli'
cask 'caffeine'
cask 'discord'
cask 'docker'
cask 'figma'
cask 'github'
cask 'google-chrome'
cask 'httpie'
cask 'imageoptim'
cask 'loom'
cask 'notion'
cask 'raycast'
cask 'reflex'
cask 'screen-studio'
cask 'tableplus'
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'transmit'
cask 'tunnelbear'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Mac App Store
mas 'Spark', id: 1176895641
